[
  {
    "title": "Senior Developer",
    "organization": "Duke University School of Medicine, Office of Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "December 2022 - Current",
    "bullet_points": [
      "Build web services for tracking research effort across both the university and the health system.",
      "Integrate the OpenShift platform into existing devops workflows for enhanced developer productivity and application reliability."
    ]
  },
  {
    "title": "Developer",
    "organization": "North Carolina State University, Enterprise Application Services",
    "link": "https://oit.ncsu.edu/about/units/eas/",
    "dates": "June 2020 - December 2022",
    "bullet_points": [
      "Develop custom enhancements and integrations for the university’s centralized research data management system using PHP and jQuery.",
      "Set up ETL pipelines in SAS Data Integration Studio to capture enterprise data for operational work and reporting."
    ]
  },
  {
    "title": "Developer",
    "organization": "Duke University School of Medicine, Office of Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "July 2018 - June 2020",
    "bullet_points": [
      "Built Ruby on Rails web services for data sourced from multiple Duke systems, including clinical trials, research finance, and conflict of interest.",
      "Developed enhancements for Duke's proposal submission and award management applications, and MyResearchHome, a centralized web portal for the Duke research community, using Ruby on Rails and React."
    ]
  },
  {
    "title": "Report Writer / Data Analyst",
    "organization": "Duke University School of Medicine, Office of Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "June 2015 - July 2018",
    "bullet_points": [
      "Collected user requirements and built reports and dashboards to track research operations data using BusinessObjects, JasperReports, and Tableau.",
      "Served as technical lead on the successful, multi-year migration of existing enrollment data out of Duke's Epic instance and into a single clinical trial management application."
    ]
  },
  {
    "title": "Business Analyst",
    "organization": "SBG Technology Solutions",
    "link": "https://sbgts.com/",
    "dates": "December 2012 - June 2015",
    "bullet_points": [
      "Assisted project managers in directing multiple healthcare IT projects for the federal government."
    ]
  },
  {
    "title": "Research Associate",
    "organization": "TransAnalytics",
    "link": "https://transanalytics.com/",
    "dates": "December 2010 - December 2012",
    "bullet_points": [
      "Developed and maintained interfaces, queries, and reports in Access and Excel for analyzing traffic fatalities from a nationwide database."
    ]
  }
]
