[
  {
    "title": "Data Integration Developer",
    "organization": "Civic Federal Credit Union",
    "link": "https://www.civicfcu.org/",
    "dates": "March 2025 - Current",
    "bullet_points": [
      "Set up ETL pipelines for mortgage data following operational independence from State Employees' Credit Union and the transition to a new core banking system.",
      "Build out data warehouse focused on analytical reporting from Fiserv DNA banking platform transactional data.",
      "Improve speed and performance of existing data pipelines by optimizing SQL queries and implementing incremental data loading strategies."
    ]
  },

  {
    "title": "Senior Systems Analyst",
    "organization": "ElectriCities of NC",
    "link": "https://www.electricities.com",
    "dates": "May 2024 - March 2025",
    "bullet_points": [
      "Automated data collection to improve auditing of municipalities' electrical utility billing systems.",
      "Served as liaison between municipalities and commercial software vendors.",
      "Assisted in monitoring and outreach efforts for municipalities' annual EIA Form 861 federal compliance reporting."
    ]
  },
  {
    "title": "Senior Developer",
    "organization": "Duke University School of Medicine, Office of Academic Solutions and Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "December 2022 - May 2024",
    "bullet_points": [
      "Built web services for tracking research effort across both the university and the health system.",
      "Integrated new tools, including GitLab CI/CD and the OpenShift platform, into existing devops workflows for enhanced developer productivity and application reliability.",
      "Onboarded and mentored junior developers."
    ]
  },
  {
    "title": "Developer",
    "organization": "North Carolina State University, Enterprise Application Services",
    "link": "https://oit.ncsu.edu/leadership-and-units/enterprise-application-services/",
    "dates": "June 2020 - December 2022",
    "bullet_points": [
      "Designed tooling to migrate legacy data and enable ongoing data transfer from internally developed applications into the university’s new vendor-developed research data management system.",
      "Build initial set of ETL pipelines in SAS Data Integration Studio to capture enterprise data for operational work and reporting, moving from a highly manual process to a series of automated and monitored jobs.",
      "Retained as consultant to provide customized enhancements as additional modules of the research data management system are brought online."
    ]
  },
  {
    "title": "Developer",
    "organization": "Duke University School of Medicine, Office of Academic Solutions and Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "July 2018 - June 2020",
    "bullet_points": [
      "Built Ruby on Rails web services for data sourced from multiple Duke systems, including clinical trials, research finance, and conflict of interest.",
      "Developed enhancements for Duke's proposal submission and award management applications, and MyResearchHome, a centralized web portal for the Duke research community, using Ruby on Rails and React."
    ]
  },
  {
    "title": "Data Analyst",
    "organization": "Duke University School of Medicine, Office of Academic Solutions and Information Systems",
    "link": "https://medschool.duke.edu/research/research-support/research-support-offices/oasis",
    "dates": "June 2015 - July 2018",
    "bullet_points": [
      "Collected user requirements and built reports and dashboards to track research operations data using BusinessObjects and Tableau.",
      "Served as technical lead on the successful multi-year migration of existing enrollment data out of Duke's Epic instance and into a single clinical trial management application."
    ]
  },
  {
    "title": "Business Analyst",
    "organization": "SBG Technology Solutions",
    "link": "https://sbgts.com/",
    "dates": "December 2012 - June 2015",
    "bullet_points": [
      "Assisted project managers in directing multiple healthcare IT projects for the federal government."
    ]
  },
  {
    "title": "Research Associate",
    "organization": "TransAnalytics",
    "link": "https://transanalytics.com/",
    "dates": "December 2010 - December 2012",
    "bullet_points": [
      "Developed and maintained interfaces, queries, and reports in Access and Excel for analyzing traffic fatalities from a nationwide geographic database."
    ]
  }
]
